from datetime import datetime, time


def convert_time(dt=None):
    print(dt.strftime('%H:%M'))

    minutes_to_words = {0: ("", ""), 1: ("одна минута", "одной минуты"), 2: ("две минуты", "двух минут"),
                        3: ("три минуты", "трёх минут"), 4: ("четыре минуты", "четырёх минут"),
                        5: ("пять минут", "пяти минут"), 6: ("шесть минут", "шести минут"),
                        7: ("семь минут", "семи минут"), 8: ("восемь минут", "восьми минут"),
                        9: ("девять минут", "девяти минут"), 10: ("десять минут", "десяти минут"),
                        11: ("одиннадцать минут", "одиннадцати минут"), 12: ("двенадцать минут", "двенадцати минут"),
                        13: ("тринадцать минут", "тринадцати минут"), 14: ("четырнадцать минут", "четырнадцати минут"),
                        15: ("пятнадцать минут", "пятнадцати минут"), 16: ("шестнадцать минут", ""),
                        17: ("семнадцать минут", ""), 18: ("восемнадцать минут", ""),
                        19: ("девятнадцать минут", ""), 20: ("двадцать минут", ""),
                        21: ("двадцать одна минута", ""), 22: ("двадцать две минуты", ""),
                        23: ("двадцать три минуты", ""), 24: ("двадцать четыре минуты", ""),
                        25: ("двадцать пять минут", ""), 26: ("двадцать шесть минут", ""),
                        27: ("двадцать семь минут", ""), 28: ("двадцать восемь минут", ""),
                        29: ("двадцать девять минут", ""), 30: ("", ""), 31: ("тридцать одна минута", ""),
                        32: ("тридцать две минуты", ""), 33: ("тридцать три минуты", ""),
                        34: ("тридцать четыре минуты", ""),35: ("тридцать пять минут", ""),
                        36: ("тридцать шесть минут", ""), 37: ("тридцать семь минут", ""),
                        38: ("тридцать восемь минут", ""), 39: ("тридцать девять минут", ""),
                        40: ("сорок минут", ""), 41: ("сорок одна минута", ""), 42: ("сорок две минуты", ""),
                        43: ("сорок три минуты", ""), 44: ("сорок четыре минуты", "")}

    hours_to_words = {1: ("час", "первого"), 2: ("два", "второго"), 3: ("три", "третьего"), 4: ("четыре", "четвёртого"),
                      5: ("пять ", "пятого"), 6: ("шесть", "шестого"), 7: ("семь", "седьмого"),
                      8: ("восемь", "восьмого"), 9: ("девять", "девятого"), 10: ("десять", "десятого"),
                      11: ("одиннадцать", "одиннадцатого"), 12: ("двенадцать", "двенадцатого")}

    minutes = int(dt.strftime('%M'))
    hours = int(dt.strftime('%I'))

    if minutes == 0:
        print(f'{hours_to_words[hours][0]} ровно')
    elif 0 < minutes < 30 and hours <= 12:
        print(f'{minutes_to_words[minutes][0]} {hours_to_words[hours % 12 + 1][1]}')
    elif minutes == 30:
        print(f'половина {hours_to_words[hours % 12 + 1][1]}')
    elif 31 <= minutes <= 44 and hours <= 12:
        print(f'{minutes_to_words[minutes][0]} {hours_to_words[hours % 12 + 1][1]}')
    elif 45 <= minutes < 60 and hours <= 12:
        print(f'без {minutes_to_words[60 - minutes][1]} {hours_to_words[hours % 12 +1][0]}')


if __name__ == '__main__':
    print("modes: 0 - manual input; 1 - current time; 2 - autotest")
    mode = input("select mode: ")

    if mode == '0':
        user_input = input('please input time format (HH:MM): ')
        dt = time.fromisoformat(user_input)
        convert_time(dt)
    elif mode == '1':
        dt = datetime.now()
        convert_time(dt)
    elif mode == '2':
        test_times = [
            '00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '07:00', '08:00', '09:00', '10:00', '11:00',
            '12:00', '00:05', '01:05', '02:05', '03:05', '04:05', '05:05', '06:05', '07:05', '08:05', '09:05', '10:05',
            '11:05', '12:05', '00:30', '01:30', '02:30', '03:30', '04:30', '05:30', '06:30', '07:30', '08:30', '09:30',
            '10:30', '11:30', '12:30', '00:35', '01:35', '02:35', '03:35', '04:35', '05:35', '06:35', '07:35', '08:35',
            '09:35', '10:35', '11:35', '12:35', '00:45', '01:45', '02:45', '03:45', '04:45', '05:45', '06:45', '07:45',
            '08:45', '09:45', '10:45', '11:45', '12:45', '00:55', '01:55', '02:55', '03:55', '04:55', '05:55', '06:55',
            '07:55', '08:55', '09:55', '10:55', '11:55', '12:55', '23:00', '23:05', '23:55', '23:30',
        ]
        for test_time in test_times:
            test_dt = time.fromisoformat(test_time)
            try:
                convert_time(test_dt)
            except KeyError:
                print(f'error in {test_time}')
            print()

        print('minutes test')
        for minutes in range(60):
            test_time = "00:{0:02d}".format(minutes)
            test_dt = time.fromisoformat(test_time)
            try:
                convert_time(test_dt)
            except KeyError:
                print(f'error in {test_time}')
            print()
    else:
        print('incorrect input')
        exit()
