
import datetime

a = datetime.datetime.now()
print(a)

h = {0: "ноль", 1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
     7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
     14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать",
     19: "девятнадцать", 20: "двадцать", 21: "двадцать один", 22: "двадцать два", 23: "двадцать три",
     24: "двадцать четыре"}
m = {0: "ровно", 1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
     7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
     14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать",
     19: "девятнадцать", 20: "двадцать", 21: "двадцать один", 22: "двадцать два", 23: "двадцать три",
     24: "двадцать четыре", 25: "двадцать пять", 26: "двадцать шесть", 27: "двадцать семь", 28: "двадцать восемь",
     29: "двадцать девять", 30: "пол", 31: "тридцать один", 32: "тридцать два", 33: "тридцать три",
     34: "тридцать четыре",
     35: "тридцать пять", 36: "тридцать шесть", 37: "тридцать семь", 38: "тридцать восемь", 39: "тридцать девять",
     40: "сорок", 41: "сорок один", 42: "сорок два", 43: "сорок три", 44: "сорок четыре", 45: "без пятнадцати",
     46: "сорок шесть", 47: "сорок семь",
     48: "сорок восемь", 49: "сорок девят", 50: "пятьдесят", 51: "пятьдесят один", 52: "пятьдесят два",
     53: "пятьдесят три", 54: "пятьдесят четыре", 55: "пятьдесят пять", 56: "пятьдесят шесть", 57: "пятьдесят семь",
     58: "пятьдесят восемь", 59: "пятьдесят девять"}
z = {1: "первого ", 2: "второго", 3: "третьего", 4: "четвертого", 5: "пятого", 6: "шестого", 7: "седьмого",
     8: "восьмого", 9: "девятого", 10: "десятого", 11: "одиннадцатого", 12: "двеннадцатого",
     13: "первого", 14: "второго", 15: "третьего", 16: "четвертого", 17: "пятого", 18: "шестого", 19: "седьмого",
     20: "восьмого", 21: "девятого", 22: "десятого", 23: "одиннадцатого", 24: "двеннадцатого"
     }
x = int(input("hh "))
m1 = int(input("mm "))
v = h.get(x)
min = m.get(m1)
q = z.get(x)
if m1 == 0:
    print(f'{v[0:15]} часа ровно')
elif m1 < 30:
    print(f'{min[0:15]} минуты {q[0:15]}')
elif m1 == 30:
    print(f'половина {q[0:15]}')
elif m1 > 30:
    print(f'{min[0:15]} минут {q[0:15]}')
else:
    print(f'без {min[0:15]}v[0:15]')