# Депозит:
# начальная сумма - 20000 BYN
# срок - 5 лет
# процент (годовой) - 15%

# Вычислить сумму на счету в конце указанного срока
depozit = 20000
procent = 15
god = 1825
a = 365
f = (depozit * procent * god / a) / 100
print(f)





